# FamilySizeTableErrorInfo Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilySizeTableErrorInfo Members
FamilySizeTableErrorInfo Class Constructors Methods Properties See Also
---
The FamilySizeTableErrorInfo type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilySizeTableErrorInfo | Constructs a new FamilySizeTableErrorInfo with default settings. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FamilySizeTableErrorInfo |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilySizeTableErrorType | The error type. |
| FilePath | The path of the imported CSV file. |
| InvalidColumnIndex | The index of the invalid column. |
| InvalidHeaderText | The invalid header text. |
| InvalidRowIndex | The index of the invalid row. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace